#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//操作符讲解：
//int main()
//{
//	int a = 5 / 2; 
//	printf("a=%d\n", a);//a = 2
//	double b= 5 / 2.0;
//	printf("b=%lf\n", b);//b = 2.500000
//	return 0;
//}//除了取模之外，其他操作符都可以用于整数和浮点数


////移位操作符
//// >>  --右移操作符（二进制）
//// 整数的二进制表示有：原码，反码，补码
//// 存储到内存的是补码
////100000000000000000000000000000001 -原码
////111111111111111111111111111111110 -反码
////111111111111111111111111111111111 -补码
////列子：
//int main()
//{
//	int a = -2;
//	int b = a >> 1;
//	printf("%d\n", b);//-1
//	return 0;
// 正数原码、反码、补码 相等；
//}//解释：原码：10000000000000000000000000000010  --       对补码进行操作        --10000000000000000000000000000001 --输出原码-- = -1
////      反码：11111111111111111111111111111101  --        进行>>操作后          --11111111111111111111111111111110
////      补码：11111111111111111111111111111110  --  最高位取1（负数）|| 0（正数）--11111111111111111111111111111111
////      反码 +1 = 补码

//
//int main()
//{
//	int a = 5;
//	int b = a << 1;//10
//	//00000000000000000000000000000101 --- 00000000000000000000000000001010
//	int c = a >> 1;//2
//	//00000000000000000000000000000101 --- 00000000000000000000000000000010
//	printf("b=%d\n", b);
//	printf("c=%d\n", c);
//	return 0;
//
//}//左移操作符<< :左边丢弃，右边补0
////只能作用于整数
////移位操作符不可移动负位
//int num = 10;
//num >> -1;//error
////
//
//
//
//位操作符：
//& //按位与   //二进制位与
//| //按位或   //二进制位或
//^ //按位异或 //二进制位异或
////例如下：
//int main()
//{
//	int a = 3;      //00000000000000000000000000000011
//	int b = 5;      //00000000000000000000000000000101   即类似数学中的：同时为真才为真
//	int c = a & b;  //00000000000000000000000000000001
//	printf("%d\n", c);//1
//	int d = 3;      //00000000000000000000000000000011
//	int e = 5;      //00000000000000000000000000000101   即类似数学中的：有一个为真即为真
//	int f = d | e;  //00000000000000000000000000000111
//	printf("%d\n", f);//7
//	int g = 3;      //00000000000000000000000000000011
//	int h = 5;      //00000000000000000000000000000101   相同为0，相异为1
//	int i = g ^ h;  //00000000000000000000000000000110
//	printf("%d\n", i);//6
//	return 0;
//}



//不通过临时变量，交换两个数值
//int main()
//{
//	int a = 10;
//	int b = 6;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d\nb=%d", a, b);
//	return 0;
//}


//计算一个数的二进制数中1的个数
int main()
{
	int flag = 0;
	int num = 0;
	int count = 0;
	do
	{
		scanf("%d", &num);
		int i = 0;
		for (i = 0; i < 32; i++)
		{
			if (1 == ((num >> i) & 1))
				count++;
		}
		printf("%d\n", count);
		printf("退出，请按 0\n");
		scanf("%d",&flag);//这个代码的&忘记了，耗费了我将近两个小时去寻找问题//自学路上的第一次令我头疼的事
	} 
	while (flag);
	return 0;
}


//int main()
//{
//	int tmp = 1;
//	printf("hehe\n");
//	scanf("%d", tmp);
//	return 0;
//}








  

